tests/stripe_responses/checkout_success.json

{
    "id": "evt_0MTohPWiw1pQSikDETfbzbYC",
    "object": "event",
    "api_version": "2022-11-15",
    "created": 1674575175,
    "data": {
      "object": {
        "id": "cs_test_a1SvHRuKODv1ynsB8uetltxjpxYRMfRhZHuOgwlzOD4u3kXtxOiiwCZEw6",
        "object": "checkout.session",
        "after_expiration": null,
        "allow_promotion_codes": null,
        "amount_subtotal": 8800,
        "amount_total": 8800,
        "automatic_tax": {
          "enabled": false,
          "status": null
        },
        "billing_address_collection": null,
        "cancel_url": "http://localhost/payment/error",
        "client_reference_id": null,
        "consent": null,
        "consent_collection": null,
        "created": 1674575159,
        "currency": "gbp",
        "custom_text": {
          "shipping_address": null,
          "submit": null
        },
        "customer": "cus_NEHFH2J0daWTKh",
        "customer_creation": "always",
        "customer_details": {
          "address": {
            "city": null,
            "country": "GB",
            "line1": null,
            "line2": null,
            "postal_code": "444",
            "state": null
          },
          "email": "admin@example.com",
          "name": "444",
          "phone": null,
          "tax_exempt": "none",
          "tax_ids": [
          ]
        },
        "customer_email": "admin@example.com",
        "expires_at": 1674661559,
        "invoice": null,
        "invoice_creation": {
          "enabled": false,
          "invoice_data": {
            "account_tax_ids": null,
            "custom_fields": null,
            "description": null,
            "footer": null,
            "metadata": {
            },
            "rendering_options": null
          }
        },
        "livemode": false,
        "locale": null,
        "metadata": {
          "campaign_id": "456",
          "fund_id": "123",
          "request_id": "789"
        },
        "mode": "payment",
        "payment_intent": "pi_2MToh9Wiw1pQSikD1lcBIa3o",
        "payment_link": null,
        "payment_method_collection": "always",
        "payment_method_options": {
        },
        "payment_method_types": [
          "card"
        ],
        "payment_status": "paid",
        "phone_number_collection": {
          "enabled": false
        },
        "recovered_from": null,
        "setup_intent": null,
        "shipping_address_collection": null,
        "shipping_options": [
        ],
        "status": "complete",
        "submit_type": null,
        "subscription": null,
        "success_url": "http://localhost/payment/success",
        "total_details": {
          "amount_discount": 0,
          "amount_shipping": 0,
          "amount_tax": 0
        },
        "url": null,
        "shipping_cost": null,
        "shipping_details": null
      }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
      "id": null,
      "idempotency_key": null
    },
    "type": "checkout.session.completed"
  }
